Revit 2027 API
SymbolTypeId.KgCO2ePerItem Property
 Symbol kgCO₂e/item, indicating kilograms Carbon Dioxide per item
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KgCO2ePerItem { get; }
Public Shared ReadOnly Property KgCO2ePerItem As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KgCO2ePerItem {
	ForgeTypeId^ get ();
}
static member KgCO2ePerItem : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace